-- "addons\\rised_craft_system\\lua\\entities\\rcs_workbench\\shared.lua"
-- Retrieved by https://github.com/lewisclark/glua-steal
ENT.Type = "anim"
ENT.Base = "base_anim"
 
ENT.PrintName= "Стол для крафта"
ENT.Author= "D-Rised"
ENT.Purpose		= ""
ENT.Instructions= ""
ENT.Category		= "A - Rised - [Крафт]"

ENT.Editable		= true
ENT.Spawnable		= true
ENT.AdminOnly		= true

RisedCraft_Items = {
    ["swb_ak74"] = {
        [1] = "Ствол 5.45мм",
        [2] = "Двухрежимный УСМ",
        [3] = "Продольно-скользящий затвор",
        [4] = "",
        [5] = "Газовая трубка",
    },
    ["swb_akm"] = {
        [1] = "Ствол 7.62мм",
        [2] = "Двухрежимный УСМ",
        [3] = "Продольно-скользящий затвор",
        [4] = "",
        [5] = "Газовая трубка",
    },
    ["swb_rpk"] = {
        [1] = "Ствол 7.62мм",
        [2] = "Двухрежимный УСМ",
        [3] = "Продольно-скользящий затвор",
        [4] = "",
        [5] = "Газовая трубка",
    },
    ["swb_asval"] = {
        [1] = "Ствол 9.39мм",
        [2] = "Двухрежимный УСМ",
        [3] = "Продольно-скользящий затвор",
        [4] = "",
        [5] = "Газовая трубка",
    },
    ["swb_sks"] = {
        [1] = "Ствол 7.62мм",
        [2] = "Однорежимный УСМ",
        [3] = "Продольно-скользящий затвор",
        [4] = "",
        [5] = "Газовая трубка",
    },
    ["swb_cheytac"] = {
        [1] = "Ствол 10.33мм",
        [2] = "Однорежимный УСМ",
        [3] = "Затвор болтового типа",
        [4] = "",
        [5] = "Отсечка-отражатель",
    },
    ["swb_mosin"] = {
        [1] = "Ствол 7.62мм",
        [2] = "Однорежимный УСМ",
        [3] = "Затвор болтового типа",
        [4] = "",
        [5] = "Отсечка-отражатель",
    },
    ["swb_shotgun"] = {
        [1] = "Ствол 18.5мм",
        [2] = "Однорежимный УСМ",
        [3] = "Затвор рычажного типа",
        [4] = "Клин затвора",
        [5] = "Газовая трубка",
    },
    ["swb_toz"] = {
        [1] = "Ствол 18.5мм",
        [2] = "Двухрежимный УСМ",
        [3] = "Затвор рычажного типа",
        [4] = "",
        [5] = "Цевье продольно-скользящего типа",
    },
    ["swb_sawedoff"] = {
        [1] = "Ствол 18.5мм",
        [2] = "УСМ куркового типа",
        [3] = "Колодка от курковки",
        [4] = "",
        [5] = "Эжектор от курковки",
    },
    ["swb_pistol"] = {
        [1] = "Ствол 9.19мм",
        [2] = "Двухрежимный УСМ",
        [3] = "Возвратная пружина",
        [4] = "",
        [5] = "",
    },
    ["swb_tt"] = {
        [1] = "Ствол 7.62мм",
        [2] = "Однорежимный УСМ",
        [3] = "Возвратная пружина",
        [4] = "",
        [5] = "",
    },
    ["swb_gsh18"] = {
        [1] = "Ствол 9.19мм",
        [2] = "Однорежимный УСМ",
        [3] = "Возвратная пружина",
        [4] = "",
        [5] = "",
    },
    ["swb_357"] = {
        [1] = "Ствол 7.62мм",
        [2] = "Однорежимный УСМ",
        [3] = "Возвратная пружина",
        [4] = "",
        [5] = "",
    },
    ["swb_ismg"] = {
        [1] = "Ствол 7.62мм",
        [2] = "Однорежимный УСМ",
        [3] = "Возвратная пружина",
        [4] = "",
        [5] = "",
    },
    ["swb_smg"] = {
        [1] = "Ствол 7.62мм",
        [2] = "Однорежимный УСМ",
        [3] = "Возвратная пружина",
        [4] = "",
        [5] = "",
    },
    ["ammo_103x77"] = {
        [1] = "Порох",
        [2] = "Гильзы",
        [3] = "Пули",
        [4] = "",
        [5] = "",
    },
    ["ammo_12x70"] = {
        [1] = "Порох",
        [2] = "Гильзы",
        [3] = "Пули",
        [4] = "",
        [5] = "",
    },
    ["ammo_545x39"] = {
        [1] = "Порох",
        [2] = "Гильзы",
        [3] = "Пули",
        [4] = "",
        [5] = "",
    },
    ["ammo_762x25"] = {
        [1] = "Порох",
        [2] = "Гильзы",
        [3] = "Пули",
        [4] = "",
        [5] = "",
    },
    ["ammo_762x39"] = {
        [1] = "Порох",
        [2] = "Гильзы",
        [3] = "Пули",
        [4] = "",
        [5] = "",
    },
    ["ammo_762x54r"] = {
        [1] = "Порох",
        [2] = "Гильзы",
        [3] = "Пули",
        [4] = "",
        [5] = "",
    },
    ["ammo_9x19"] = {
        [1] = "Порох",
        [2] = "Гильзы",
        [3] = "Пули",
        [4] = "",
        [5] = "",
    },
    ["ammo_9x39"] = {
        [1] = "Порох",
        [2] = "Гильзы",
        [3] = "Пули",
        [4] = "",
        [5] = "",
    },
}